/*
 * client.c
 *
 *  Created on: 2019.4.22
 *      Author:谢昕贝
 */

#include "../../include/myhead.h"

/*函数作用：配置客户端
 *描述：初始化服务器信息
  	    创建socket
  	    连接服务器 
 *输入：无
 *返回值：无
 */
void ConfigureClient()
{
	/*局部变量*/
	int ret;
	/*初始化，设置服务器信息*/
	bzero(&server,sizeof(server));
	server.sin_family = PF_INET;
	server.sin_port = htons(PORT);
	server.sin_addr.s_addr = inet_addr(INET_ADDR);

	/*创建socket*/
	socketfd = socket(PF_INET, SOCK_STREAM, 0);
	if (socketfd < 0)
	{
		perror("socketfd");
		exit(1);
	}

	/*连接*/
	ret = connect(socketfd, (struct sockaddr *)&server, sizeof(server));
	if (ret < 0)
	{
		perror("connect");
		exit(1);
	}

	printf("connect server success!\n");
}


/*函数作用：聊天室欢迎界面
 *输入：无
 *输出：欢迎
 *返回值: 无
 */
void welcome()
{
	system("clear");
	printf("\n\n\n\n\n\n\n\n\n\n\n\n");
    printf("            Welcome\n\n");
    printf("            XXB's ChatRoom\n\n");
	printf("\n\n\n\n\n\n\n\n\n\n\n");
	sleep(1);
}

/*函数作用：登陆界面
 *输入：无
 *输出：注册、登录、退出
 *返回值: 无
 */
void login_welcome()
{
	system("clear");
	printf("*******************************************************************************\n");
	printf("*******************************************************************************\n");
	printf("**********                                                           **********\n");
	printf("**********          Welcome to XXB's ChatRoom                        **********\n");
	printf("**********                                                           **********\n");
    printf("**********          LOGIN                                            **********\n");
	printf("**********                                                           **********\n");
	printf("*******************************************************************************\n");
	printf("*******************************************************************************\n");
	printf("|                                                                             |\n");
    printf("|           1.注册                                                            |\n");
    printf("|                                                                             |\n");
    printf("|           2.登录                                                            |\n");
    printf("|                                                                             |\n");
    printf("|           0.退出                                                            |\n");
    printf("|                                                                             |\n");
    printf("|-----------------------------------------------------------------------------|\n");	
}


/*函数作用：普通用户登录界面
 *输入：无
 *输出：操作指令
 *返回值: 无
 */
void user_welcome()
{
	system("clear");
	printf("*******************************************************************************\n");
	printf("*******************************************************************************\n");
	printf("**********                                                           **********\n");
	printf("**********          Welcome to XXB's ChatRoom                        **********\n");
	printf("**********                                                           **********\n");
    printf("                    USER:%s\n",User);
	printf("**********                                                           **********\n");
	printf("*******************************************************************************\n");
	printf("*******************************************************************************\n");
	printf("|                                                                             |\n");
    printf("|           1.私聊                           6.发送文件                       |\n");
    printf("|                                           （当前版本暫时只支持文本文件传输) |\n");
    printf("|           2.群发                           7.修改密码                	      |\n");
    printf("|                                                                             |\n");
    printf("|           3.查看好友列表                   0.注销登录                       |\n");
    printf("|                                                                             |\n");
	printf("|           4.查看在线用户                                                    |\n");
	printf("|                                                                             |\n");
	printf("|           5.查看聊天记录                                                    |\n");
	printf("|                                                                             |\n");
    printf("|-----------------------------------------------------------------------------|\n");	

}

/*函数作用：管理员登录界面
 *输入：无
 *输出：操作指令
 *返回值: 无
 */
void admin_welcome()
{
	system("clear");
	printf("*******************************************************************************\n");
	printf("*******************************************************************************\n");
	printf("**********                                                           **********\n");
	printf("**********          Welcome to XXB's ChatRoom                        **********\n");
	printf("**********                                                           **********\n");
    printf("                    USER:%s\n",User);
	printf("**********                                                           **********\n");
	printf("*******************************************************************************\n");
	printf("*******************************************************************************\n");
	printf("|                                                                             |\n");
    printf("|           1.私聊                           6.发送文件                       |\n");
    printf("|                                           （当前版本暫时只支持文本文件传输) |\n");
    printf("|           2.群发                           7.修改密码                       |\n");
	printf("|                                                                             |\n");
	printf("|           3.查看好友列表                   8.禁言                           |\n");
    printf("|                                                                             |\n");
    printf("|           4.查看在线用户                   9.踢人                           |\n");
    printf("|                                                                             |\n");
	printf("|           5.查看聊天记录                   0.注销登录                       |\n");
	printf("|                                                                             |\n");
    printf("|-----------------------------------------------------------------------------|\n");	
}


/*函数作用：聊天手册
 *输入：无
 *输出：聊天快捷键
 *返回值: 无
 */
void chat_help()
{
	system("clear");
	printf("|-----------------------------------------------------------------------------|\n");
	printf("|----                        聊天帮助手册                                 ----|\n");
	printf("|-----------------------------------------------------------------------------|\n");
	printf("|                                                                             |\n");
    printf("|           常用语                               常用表情                     |\n");
    printf("|       \\dbq  : 对不起                      \\hh  :{表情}大笑                  |\n");
    printf("|       \\xswl : 笑死我了                    \\wx  :{表情}微笑                  |\n");
    printf("|       \\2333 : 哈哈哈hhhhh                 \\ng  :{表情}难过                  |\n");
    printf("|       \\nbcs : Nobody cares.               \\dk  :{表情}大哭                  |\n");
    printf("|       \\skr  : 热skr人了                   \\dy  :{表情}得意                  |\n");
	printf("|       \\wtf  : What the fuck\?\?!!           \\cr  :{表情}锤人                  |\n"); //因为在linux中不对齐，不知道为什么
	printf("|       \\xo   : I Love U!!                  \\tx  :{表情}吐血                  |\n");
	printf("|                                                                             |\n");
    printf("|-----------------------------------------------------------------------------|\n");	
}



